chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mx150f128d.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _TMR_P32MX150F128D_H
#define _TMR_P32MX150F128D_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    TMR_ID_1 = 0,
    TMR_ID_2,
    TMR_ID_4,
    TMR_ID_3,
    TMR_ID_5,
    TMR_NUMBER_OF_MODULES

} TMR_MODULE_ID;

typedef enum {

    TMR_PRESCALE_VALUE_1 = 0x00,
    TMR_PRESCALE_VALUE_2 = 0x01,
    TMR_PRESCALE_VALUE_4 = 0x02,
    TMR_PRESCALE_VALUE_8 = 0x03,
    TMR_PRESCALE_VALUE_16 = 0x04,
    TMR_PRESCALE_VALUE_32 = 0x05,
    TMR_PRESCALE_VALUE_64 = 0x06,
    TMR_PRESCALE_VALUE_256 = 0x07

} TMR_PRESCALE;

typedef enum {

    TMR_CLOCK_SOURCE_PERIPHERAL_CLOCK = 0,
    TMR_CLOCK_SOURCE_EXTERNAL_INPUT_PIN = 1

} TMR_CLOCK_SOURCE;

PLIB_INLINE SFR_TYPE* _TMR_ENABLE_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &T1CON;
        case TMR_ID_2 :
            return &T2CON;
        case TMR_ID_4 :
            return &T4CON;
        case TMR_ID_3 :
            return &T3CON;
        case TMR_ID_5 :
            return &T5CON;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_STOP_IN_IDLE_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &T1CON;
        case TMR_ID_2 :
            return &T2CON;
        case TMR_ID_4 :
            return &T4CON;
        case TMR_ID_3 :
            return &T3CON;
        case TMR_ID_5 :
            return &T5CON;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_ASYNC_TIMER_WRITE_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &T1CON;
        case TMR_ID_2 :
            return (SFR_TYPE*)-1;
        case TMR_ID_4 :
            return (SFR_TYPE*)-1;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_COUNTER_ASYNC_WRITE_IN_PROGRESS_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &T1CON;
        case TMR_ID_2 :
            return (SFR_TYPE*)-1;
        case TMR_ID_4 :
            return (SFR_TYPE*)-1;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_GATED_TIME_ACCUMULATION_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &T1CON;
        case TMR_ID_2 :
            return &T2CON;
        case TMR_ID_4 :
            return &T4CON;
        case TMR_ID_3 :
            return &T3CON;
        case TMR_ID_5 :
            return &T5CON;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_PRESCALE_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &T1CON;
        case TMR_ID_2 :
            return &T2CON;
        case TMR_ID_4 :
            return &T4CON;
        case TMR_ID_3 :
            return &T3CON;
        case TMR_ID_5 :
            return &T5CON;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_CLOCK_SOURCE_SYNC_INVERTED_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &T1CON;
        case TMR_ID_2 :
            return (SFR_TYPE*)-1;
        case TMR_ID_4 :
            return (SFR_TYPE*)-1;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_CLOCK_SOURCE_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &T1CON;
        case TMR_ID_2 :
            return &T2CON;
        case TMR_ID_4 :
            return &T4CON;
        case TMR_ID_3 :
            return &T3CON;
        case TMR_ID_5 :
            return &T5CON;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_PERIOD_REGISTER_16BIT_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &PR1;
        case TMR_ID_2 :
            return &PR2;
        case TMR_ID_4 :
            return &PR4;
        case TMR_ID_3 :
            return &PR3;
        case TMR_ID_5 :
            return &PR5;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_PERIOD_MATCH_MODE_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &PR1;
        case TMR_ID_2 :
            return &TMR2;
        case TMR_ID_4 :
            return &TMR4;
        case TMR_ID_3 :
            return &TMR3;
        case TMR_ID_5 :
            return &TMR5;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_VALUE_REGISTER_16BIT_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &TMR1;
        case TMR_ID_2 :
            return &TMR2;
        case TMR_ID_4 :
            return &TMR4;
        case TMR_ID_3 :
            return &TMR3;
        case TMR_ID_5 :
            return &TMR5;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_MODE_16BIT_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return &T2CON;
        case TMR_ID_4 :
            return &T4CON;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_MODE_32BIT_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return &T2CON;
        case TMR_ID_4 :
            return &T4CON;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_PERIOD_REGISTER_16BIT_LOW_32_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return &PR2;
        case TMR_ID_4 :
            return &PR4;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_VALUE_REGISTER_16BIT_LOW_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return &TMR2;
        case TMR_ID_4 :
            return &TMR4;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_PERIOD_REGISTER_16BIT_HIGH_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return (SFR_TYPE*)-1;
        case TMR_ID_4 :
            return (SFR_TYPE*)-1;
        case TMR_ID_3 :
            return &PR3;
        case TMR_ID_5 :
            return &PR5;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_VALUE_REGISTER_16BIT_HIGH_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return (SFR_TYPE*)-1;
        case TMR_ID_4 :
            return (SFR_TYPE*)-1;
        case TMR_ID_3 :
            return &TMR3;
        case TMR_ID_5 :
            return &TMR5;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

